Revit 2017 API
FabricSheet.GetSegmentParameterIdsAndLengths Method
 Returns the array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.).
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2017
Syntax
C#
public IDictionary<ElementId, double> GetSegmentParameterIdsAndLengths(
	bool rounded
)
Visual Basic
Public Function GetSegmentParameterIdsAndLengths ( _
	rounded As Boolean _
) As IDictionary(Of ElementId, Double)
Visual C++
public:
IDictionary<ElementId^, double>^ GetSegmentParameterIdsAndLengths(
	bool rounded
)
Parameters
rounded
Type: System.Boolean
 Set to true to return rounded values for segments lengths.
Return Value
 Array of pairs [parameter ID, length] that correspond to segments of a bent fabric sheet (like A, B, C, D etc.) is returned for bend fabric sheet. For flat fabric sheet (not bent) empty array is returned.
Remarks
 This method does not provide alphabetical nor any other order of returned parameters.
See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace